# Applications
cask "google-chrome"
cask "discord"
cask "iterm2"
cask "spectacle"
cask "homebrew/cask-fonts/font-source-code-pro"
cask "mactex-no-gui"
cask "xquartz"
cask "iterm2"

# packages
brew "htop"
brew "neovim"
brew "tmux"
brew "clang-format"
brew "cmake"
brew "ccls"
brew "zsh-syntax-highlighting"
brew "node"
