# Taps
tap "homebrew/cask-fonts"

# packages
brew "htop"
brew "neovim"
brew "tmux"
brew "clang-format"
brew "cmake"
brew "ccls"
brew "zsh-syntax-highlighting"
brew "node"
brew "autopep8"
brew "svn"
brew "gpg"

# Applications
cask "google-chrome"
cask "discord"
cask "iterm2"
cask "spectacle"
cask "font-source-code-pro"
cask "mactex-no-gui"
cask "xquartz"
cask "spotify"
cask "inkscape"

