# Taps
tap "homebrew/cask-fonts"

# packages
brew "htop"
brew "neovim"
brew "tmux"
brew "clang-format"
brew "cmake"
brew "zsh-syntax-highlighting"
brew "autopep8"
brew "gpg"
brew "gnuplot"
brew "virtualenv"

# Applications
cask "firefox"
cask "discord"
cask "iterm2"
cask "spectacle"
cask "mactex-no-gui"
cask "xquartz"
cask "spotify"
cask "cyberduck"
cask "dataspell"
cask "pycharm"
cask "zotero"

# Fonts
cask "font-sauce-code-pro-nerd-font"
cask "font-terminess-ttf-nerd-font"
