# Taps
tap "homebrew/cask-fonts"

# packages
brew "htop"
brew "neovim"
brew "tmux"
brew "clang-format"
brew "cmake"
brew "zsh-syntax-highlighting"
brew "autopep8"
brew "gpg"
brew "gnuplot"
brew "virtualenv"
brew "pass"
brew "eza"

# Temp for neomutt
brew "neomutt"
brew "isync"
brew "msmtp"
brew "lynx"
brew "erikw/tap/xdg-urlview"
brew "pandoc"
brew "lbdb"
brew "khard"

# Applications
cask "firefox"
cask "discord"
cask "alacritty"
cask "rectangle"
cask "mactex-no-gui"
cask "xquartz"
cask "spotify"
cask "cyberduck"
cask "dataspell"
cask "zotero"
cask "skim"
cask "wezterm"

# I still like DinaRemasterII
# Fonts
cask "font-sauce-code-pro-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-computer-modern"
